validation/denseAGFoam/fluidizedBed/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default         cellLimited     leastSquares .2;
    grad(p_rgh)     leastSquares;
}

divSchemes
{
    default                         none;

    "div\(phi.*,alpha.*\)"          Gauss vanLeer;
    "div\(phir,alpha.*\)"           Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"      Gauss limitedLinearV 0.2;
    "div\(phi.*,U.*\)"              Gauss limitedLinearV 0.2;

    "div\(alphaRhoPhi.*,(h|e).*\)"  Gauss limitedLinear 0.2;
    "div\(alphaRhoPhi.*,K.*\)"      Gauss limitedLinear 0.2;
    "div\(alphaPhi.*,p\)"           Gauss limitedLinear 0.2;

    "div\(alphaRhoPhi.*,Theta.*\)"  Gauss limitedLinear 0.2;
    "div\(alphaRhoPhi.*,Sigma.*\)"  Gauss limitedLinear 0.2;
    "div\(Sigma.*\)"           Gauss linear;
    div(((alpha.gas*thermo:rho.gas)*R2)) Gauss linear;

    "div\(alphaRhoPhi.*,(k|epsilon).*\)"  Gauss limitedLinear 0.2;

    div((((alpha.gas*thermo:rho.gas)*nuEff.gas)*dev2(T(grad(U.gas))))) Gauss linear;

    div((((thermo:rho.particles*nut.particles)*dev2(T(grad(U.particles))))+(((thermo:rho.particles*lambda.particles)*div(phi.particles))*I)))  Gauss linear;
}

laplacianSchemes
{
    default     Gauss linear corrected;
    bounded     Gauss linear corrected;
}

interpolationSchemes
{
    default     linear;

    h2Fn upwind;
}

snGradSchemes
{
    default     corrected;
    bounded     corrected;
}

fluxRequired
{
    default     no;
    p;
    alpha.particles;
}

// ************************************************************************* //
